app/Controllers/Auth.php

INSERT INTO `users` (`nama`, `email`, `password`) VALUES ('Anisa Nurul Zalfaa', 'anisanurulzalfaa@gmail.com', '$2y$10$irgSGhBHn1ltMWk6aJrgSO47eMbtO7k3yUN6eyEnvojvIV7vrxR7S')
---
    public function register()
    {
        $userModel = new UserModel();

        $data = $this->request->getPost();
        if (empty($data)) {
            $data = $this->request->getJSON(true);
        }

        if (empty($data)) {
            return $this->fail(['message' => 'Tidak ada data yang diterima untuk registrasi.'], 400);
        }

        if (!$userModel->validate($data)) {
            $errors = $userModel->errors();
            return $this->failValidationErrors($errors);
        }

        $userModel->save($data);

SELECT *
FROM `users`
WHERE `email` = 'anisanurulzalfaa@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $userModel = new UserModel();

        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        if (empty($email) && empty($password)) {
            $json_data = $this->request->getJSON(true);
            $email     = $json_data['email'] ?? null;
            $password  = $json_data['password'] ?? null;
        }

        if (empty($email) || empty($password)) {
            return $this->fail(['message' => 'Email dan password harus diisi.'], 400);
        }

        $user = $userModel->where('email', $email)->first();