app/Controllers/Test.php

    public function startTest($id_test = null)
    {
        $request = $this->request;
        $decodedToken = $this->getUserFromToken();
        if (!$decodedToken) {
            return $this->failUnauthorized('Token tidak valid atau tidak ditemukan.');
        }
        $id_user = $decodedToken->uid;

        if (is_null($id_test) || !is_numeric($id_test)) {
            return $this->fail('ID Tes tidak valid atau tidak disertakan.', 400);
        }

        $existingResult = $this->testResultModel
            ->where('id_user', $id_user)
            ->where('id_test', $id_test)
            ->first();
---
SELECT *
FROM `test_result`
WHERE `id_user` = '1'
AND `id_test` = '1'
 LIMIT 1


        $currentTestResultId = $existingResult['id_result'];

        $questions = $this->questionModel->where('id_test', $id_test)->findAll();
---
SELECT *
FROM `question`
WHERE `id_test` = '1'

    public function getResult($userId = null, $testId = null)
    {
        // 1. Validasi parameter input
        if (!$userId || !$testId) {
            return $this->fail('ID User dan ID Test harus disertakan.', 400);
        }

        // 2. HANYA FOKUS MENCARI DATA YANG SUDAH ADA DI DATABASE
        // Tugasnya sekarang sangat sederhana.
        $result = $this->testResultModel
            ->where('id_user', $userId)
            ->where('id_test', $testId)
            ->first();
---
SELECT *
FROM `test_result`
WHERE `id_user` = '1'
AND `id_test` = '1'
 LIMIT 1

    protected function calculateScore(int $userId, int $testId): int
    {
        $totalScore = 0;
        $userAnswers = $this->userJawabanModel->where(['id_user' => $userId])->findAll(); // Ambil semua jawaban user
---
SELECT *
FROM `user_jawaban`
WHERE `id_user` = 1